app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "index.jpeg"], ["image_updated_at", "2020-01-16 19:12:34.064156"], ["updated_at", "2020-01-16 19:12:34.075217"], ["id", 2]]
---
    def update
      @article = Article.find(params[:id])
      @article.update(article_params)